Res-Latency-hotel/Res-container-random-v1/container_t_10_c_30_frontCore_4_wrkCore_1_R_2000/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 6.525ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 6.280ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 6.564ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 6.401ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 6.950ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 7.378ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 7.387ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 7.011ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 7.178ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 6.839ms, rate sampling interval: 40ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.05ms   13.66ms  60.16ms   86.69%
    Req/Sec   203.06    106.67   516.00     72.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.39ms
 75.000%    7.66ms
 90.000%   29.02ms
 99.000%   60.16ms
 99.900%   97.92ms
 99.990%  134.78ms
 99.999%  159.62ms
100.000%  160.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.282     0.000000            1         1.00
       1.018     0.100000        10057         1.11
       1.611     0.200000        20083         1.25
       2.083     0.300000        30149         1.43
       2.685     0.400000        40165         1.67
       3.391     0.500000        50211         2.00
       3.811     0.550000        55222         2.22
       4.307     0.600000        60237         2.50
       4.951     0.650000        65265         2.86
       5.891     0.700000        70271         3.33
       7.659     0.750000        75294         4.00
       9.399     0.775000        77807         4.44
      12.255     0.800000        80311         5.00
      15.895     0.825000        82824         5.71
      19.823     0.850000        85330         6.67
      24.159     0.875000        87840         8.00
      26.543     0.887500        89098         8.89
      29.023     0.900000        90348        10.00
      31.535     0.912500        91604        11.43
      34.431     0.925000        92866        13.33
      37.503     0.937500        94120        16.00
      39.199     0.943750        94744        17.78
      40.991     0.950000        95370        20.00
      42.847     0.956250        96004        22.86
      44.927     0.962500        96627        26.67
      47.423     0.968750        97253        32.00
      48.671     0.971875        97565        35.56
      50.047     0.975000        97881        40.00
      51.647     0.978125        98194        45.71
      53.343     0.981250        98508        53.33
      55.103     0.984375        98819        64.00
      56.255     0.985938        98975        71.11
      57.727     0.987500        99135        80.00
      59.199     0.989062        99292        91.43
      60.735     0.990625        99445       106.67
      62.527     0.992188        99602       128.00
      63.583     0.992969        99682       142.22
      64.895     0.993750        99760       160.00
      66.047     0.994531        99838       182.86
      68.095     0.995313        99916       213.33
      70.527     0.996094        99994       256.00
      72.191     0.996484       100034       284.44
      73.663     0.996875       100074       320.00
      75.775     0.997266       100112       365.71
      78.207     0.997656       100151       426.67
      81.599     0.998047       100190       512.00
      84.159     0.998242       100210       568.89
      87.231     0.998437       100230       640.00
      92.159     0.998633       100249       731.43
      95.167     0.998828       100269       853.33
      98.303     0.999023       100288      1024.00
      99.839     0.999121       100298      1137.78
     101.759     0.999219       100308      1280.00
     104.127     0.999316       100318      1462.86
     105.983     0.999414       100328      1706.67
     109.183     0.999512       100337      2048.00
     110.527     0.999561       100342      2275.56
     111.615     0.999609       100347      2560.00
     114.431     0.999658       100352      2925.71
     116.927     0.999707       100357      3413.33
     122.367     0.999756       100362      4096.00
     125.247     0.999780       100364      4551.11
     127.231     0.999805       100367      5120.00
     130.303     0.999829       100369      5851.43
     132.607     0.999854       100372      6826.67
     133.119     0.999878       100374      8192.00
     134.143     0.999890       100375      9102.22
     135.167     0.999902       100377     10240.00
     135.679     0.999915       100378     11702.86
     135.935     0.999927       100379     13653.33
     142.975     0.999939       100380     16384.00
     144.767     0.999945       100381     18204.44
     146.431     0.999951       100382     20480.00
     146.431     0.999957       100382     23405.71
     146.559     0.999963       100383     27306.67
     146.559     0.999969       100383     32768.00
     147.071     0.999973       100384     36408.89
     147.071     0.999976       100384     40960.00
     147.071     0.999979       100384     46811.43
     159.615     0.999982       100385     54613.33
     159.615     0.999985       100385     65536.00
     159.615     0.999986       100385     72817.78
     159.615     0.999988       100385     81920.00
     159.615     0.999989       100385     93622.86
     160.255     0.999991       100386    109226.67
     160.255     1.000000       100386          inf
#[Mean    =        9.051, StdDeviation   =       13.662]
#[Max     =      160.128, Total count    =       100386]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120139 requests in 1.00m, 49.65MB read
Requests/sec:   2002.12
Transfer/sec:    847.33KB